IDEA StatiCa Open Model
HingeElement1D.HingeTypeRY Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Hinge type in dirrection round Y
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public HingeTypeInDirrection HingeTypeRY { get; set; }
Public Property HingeTypeRY As HingeTypeInDirrection
	Get
	Set
public:
property HingeTypeInDirrection HingeTypeRY {
	HingeTypeInDirrection get ();
	void set (HingeTypeInDirrection value);
}
Property Value
Type: HingeTypeInDirrection
See Also
Reference
HingeElement1D Class
IdeaRS.OpenModel.Model Namespace